In [2]:
import sqlalchemy
%load_ext sql
%sql oracle://scott:tiger@localhost:1521/orcl

# 출력되는 행 제한하기 1(ROWNUM)
"rownum을 이용하면 출력되는 행의 갯수를 제한할 수 있다."

In [3]:
%%sql

select rownum, empno, ename, sal
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(1, 7839, 'KING', Decimal('5000')),
 (2, 7698, 'BLAKE', Decimal('2850')),
 (3, 7782, 'CLARK', Decimal('2450')),
 (4, 7566, 'JONES', Decimal('2975')),
 (5, 7654, 'MARTIN', Decimal('1250')),
 (6, 7499, 'ALLEN', Decimal('1600')),
 (7, 7844, 'TURNER', Decimal('1500')),
 (8, 7900, 'JAMES', Decimal('950')),
 (9, 7521, 'WARD', Decimal('1250')),
 (10, 7902, 'FORD', Decimal('3000')),
 (11, 7369, 'SMITH', Decimal('800')),
 (12, 7788, 'SCOTT', Decimal('3000')),
 (13, 7876, 'ADAMS', Decimal('1100')),
 (14, 7934, 'MILLER', Decimal('1300'))]

row_number( ) 함수와는 다르게 인라인뷰(from 절의 서브쿼리)를 사용하지 않고도  
위의 3개의 행만을 가져와라 같은 데이터 검색을 할 수 있다.

In [4]:
%%sql

select rownum, empno, ename, sal
    from emp
    where rownum <= 3

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(1, 7839, 'KING', Decimal('5000')),
 (2, 7698, 'BLAKE', Decimal('2850')),
 (3, 7782, 'CLARK', Decimal('2450'))]

대용량 테이블의 데이터가 있는 테이블의 내용을 살짝 보고 싶다면  
rownum을 사용해서 몇건의 데이터만 살펴보시오

In [6]:
%%sql

select *
    from emp
    where rownum <= 5

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(7839, 'KING', 'PRESIDENT', None, datetime.datetime(1981, 11, 17, 0, 0), Decimal('5000'), None, 10),
 (7698, 'BLAKE', 'MANAGER', 7839, datetime.datetime(1981, 5, 1, 0, 0), Decimal('2850'), None, 30),
 (7782, 'CLARK', 'MANAGER', 7839, datetime.datetime(1981, 5, 9, 0, 0), Decimal('2450'), None, 10),
 (7566, 'JONES', 'MANAGER', 7839, datetime.datetime(1981, 4, 1, 0, 0), Decimal('2975'), None, 20),
 (7654, 'MARTIN', 'SALESMAN', 7698, datetime.datetime(1981, 9, 10, 0, 0), Decimal('1250'), Decimal('1400'), 30)]

문제 205. 직업이 SALESMAN인 사원들의 데이터 중 2개만 출력하시오!<br>
(사원이름, 직업과 월급을 출력하시오)

In [7]:
%%sql

select ename, job, sal
    from emp
    where job = 'SALESMAN' and rownum <= 2

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('MARTIN', 'SALESMAN', Decimal('1250')),
 ('ALLEN', 'SALESMAN', Decimal('1600'))]

rownum 쓸때는 부등호 비교와 같이 사용해야 함  
등호 비교는 숫자 1만 비교됌  

<br>

문제 206. 위의 결과에서 한건만 출력되게 하시오

In [8]:
%%sql

select ename, job, sal
    from emp
    where job='SALESMAN' and rownum = 1

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('MARTIN', 'SALESMAN', Decimal('1250'))]

문제 207. emp 테이블의 데이터를 가져오는데 상위 3건만 가져와서 출력하시오  
(모든 칼럼을 다 가져오시오)

In [9]:
%%sql

select *
    from emp
    where rownum <= 3

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(7839, 'KING', 'PRESIDENT', None, datetime.datetime(1981, 11, 17, 0, 0), Decimal('5000'), None, 10),
 (7698, 'BLAKE', 'MANAGER', 7839, datetime.datetime(1981, 5, 1, 0, 0), Decimal('2850'), None, 30),
 (7782, 'CLARK', 'MANAGER', 7839, datetime.datetime(1981, 5, 9, 0, 0), Decimal('2450'), None, 10)]

# 출력되는 행 제한하기 2(Simple TOP-n Queries)

"order by 절까지 사용해서 검색하는 SELECT 문의 출력되는 행의 일부를 가져올 때 사용하는 문법"

In [10]:
%%sql

select rownum, empno, ename, sal
    from emp
    order by sal desc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(1, 7839, 'KING', Decimal('5000')),
 (12, 7788, 'SCOTT', Decimal('3000')),
 (10, 7902, 'FORD', Decimal('3000')),
 (4, 7566, 'JONES', Decimal('2975')),
 (2, 7698, 'BLAKE', Decimal('2850')),
 (3, 7782, 'CLARK', Decimal('2450')),
 (6, 7499, 'ALLEN', Decimal('1600')),
 (7, 7844, 'TURNER', Decimal('1500')),
 (14, 7934, 'MILLER', Decimal('1300')),
 (9, 7521, 'WARD', Decimal('1250')),
 (5, 7654, 'MARTIN', Decimal('1250')),
 (13, 7876, 'ADAMS', Decimal('1100')),
 (8, 7900, 'JAMES', Decimal('950')),
 (11, 7369, 'SMITH', Decimal('800'))]

order by가 수행되기 전에 rownum이 부여되어서 번호가 뒤죽박죽 섞였다  

사원 테이블에 월급이 높은 사원 4명만 출력하시오

In [11]:
%%sql

select rownum, ename, sal
    from emp
    where rownum <=4
    order by sal desc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(1, 'KING', Decimal('5000')),
 (4, 'JONES', Decimal('2975')),
 (2, 'BLAKE', Decimal('2850')),
 (3, 'CLARK', Decimal('2450'))]

In [13]:
%%sql

select ename, sal
    from emp
    where sal > 2500
    order by sal desc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', Decimal('5000')),
 ('FORD', Decimal('3000')),
 ('SCOTT', Decimal('3000')),
 ('JONES', Decimal('2975')),
 ('BLAKE', Decimal('2850'))]

제대로 출력되지 않았다.  
이유는 실행 순서때문  
3. select rownum, ename, sal  
1. from emp  
2. where rownum <= 4  
4. order by desc  
emp 테이블에서 먼저 맨위의 4명만을 가져와서 그 4명 만으로 월급이 높은 순서대로 정렬했기 때문  
위의 결과를 제대로 보려면 아래와 같이 top n query를 작성해야 함

In [14]:
%%sql

select ename, sal
    from emp
    order by sal desc
    fetch first 4 rows only

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', Decimal('5000')),
 ('FORD', Decimal('3000')),
 ('SCOTT', Decimal('3000')),
 ('JONES', Decimal('2975'))]

문제 208. 우리반에서 나이가 가장 많은 학생들의 이름과 나이를 출력하는데 5명만 출력하시오!

In [25]:
%%sql

select replace(ename, substr(ename, 2, 1), '*') as "이름",
    '*'||substr(age, 2, 1) as "나이"
    from emp12
    order by age desc
    fetch first 5 rows only

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('김*원', '*4'), ('권*원', '*6'), ('현*연', '*5'), ('김*순', '*3'), ('한*', '*1')]